scripts/request.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
	</soap:Header>
	<soap:Body>
		<m:GetStockPrice xmlns:m="http://www.example.org/stock">
			<m:StockName>IBM</m:StockName>
		</m:GetStockPrice>
	</soap:Body>
</soap:Envelope>